import { Post } from "@/types/posts";

const posts: Post[] = [
    {
        id: '1',
        title: 'شگفتی‌های فیزیک کوانتومی',
        body: 'فیزیک کوانتومی رفتار عجیب و جذاب ماده در کوچک‌ترین مقیاس‌ها را فاش می‌کند. از سوپرپوزیشن تا درهم‌تنیدگی، این حوزه چالش‌های جدیدی را برای درک واقعیت به وجود می‌آورد.',
        author: 'دکتر آلیس جانسون',
        date: '2023-01-15',
        comments: [
            {
                id: '1',
                text: 'این مقاله فوق‌العاده است! فیزیک کوانتومی واقعاً شگفت‌انگیز است.',
                username: 'user123'
            }
        ]
    },
    {
        id: '2',
        title: 'اکتشاف اعماق اقیانوس',
        body: 'اقیانوس مکان وسیع و مرموزی است که میزبان گونه‌ها و اکوسیستم‌های بی‌شماری است. اکتشافات اخیر کشفیات جدیدی درباره موجودات اعماق دریا و ژئولوژی زیر آب را به ارمغان آورده است.',
        author: 'دکتر باب اسمیت',
        date: '2023-02-20',
        comments: [
            {
                id: '1',
                text: 'هرگز نمی‌دانستم که این‌قدر درباره زندگی دریایی وجود دارد! مطالعه عالی!',
                username: 'marine_life_lover'
            },
            {
                id: '2',
                text: 'اعماق اقیانوس رازهای زیادی را در خود دارد. نمی‌توانم منتظر یادگیری بیشتر باشم!',
                username: 'explorer99'
            }
        ]
    },
    {
        id: '3',
        title: 'آینده اکتشافات فضایی',
        body: 'با پیشرفت تکنولوژی، بشریت در آستانه اکتشافات فراتر از سیاره ما است. از مأموریت‌های مریخی تا معدن‌کاوی سیارک‌ها، آینده اکتشافات فضایی پر از امکانات است.',
        author: 'دکتر کارول وایت',
        date: '2023-03-05',
        comments: [
            {
                id: '1',
                text: 'زمان‌های هیجان‌انگیزی در انتظار علاقه‌مندان به فضا است!',
                username: 'astrofan'
            }
        ]
    },
    {
        id: '4',
        title: 'درک تغییرات اقلیمی',
        body: 'تغییرات اقلیمی یکی از بزرگ‌ترین چالش‌های زمان ما است. درک علل و اثرات آن برای کاهش تأثیراتش بر روی سیاره ما ضروری است.',
        author: 'دکتر دیوید گرین',
        date: '2023-04-10',
        comments: [
            {
                id: '1',
                text: 'این واقعاً نگران‌کننده است که تغییرات اقلیمی با چه سرعتی پیش می‌رود.',
                username: 'eco_warrior'
            },
            {
                id: '2',
                text: 'ما به آگاهی بیشتری در این زمینه نیاز داریم. ممنون که به اشتراک گذاشتید!',
                username: 'nature_fan'
            }
        ]
    },
    {
        id: '5',
        title: 'تأثیر هوش مصنوعی',
        body: 'هوش مصنوعی در حال دگرگون‌سازی صنایع و جامعه است. از مراقبت‌های بهداشتی تا امور مالی، هوش مصنوعی پتانسیل بهبود کارایی و تحریک نوآوری را دارد، اما همچنین نگرانی‌های اخلاقی را به وجود می‌آورد.',
        author: 'دکتر ایو براون',
        date: '2023-05-22',
        comments: [
            {
                id: '1',
                text: 'هوش مصنوعی هم شگفت‌انگیز و هم ترسناک است!',
                username: 'techie'
            }
        ]
    },
    {
        id: '6',
        title: 'مهندسی ژنتیک: آینده پزشکی',
        body: 'پیشرفت‌های مهندسی ژنتیک وعده درمان و حتی درمان اختلالات ژنتیکی را می‌دهد. این حوزه همچنان در حال تکامل است و برای بسیاری از بیماران امید به ارمغان می‌آورد و معضلات اخلاقی را برای جامعه ایجاد می‌کند.',
        author: 'دکتر فرانک لی',
        date: '2023-06-30',
        comments: [
            {
                id: '1',
                text: 'این تکنولوژی می‌تواند زندگی‌ها را بهبود بخشد!',
                username: 'medicinal_mind'
            },
            {
                id: '2',
                text: 'ما باید با احتیاط بیشتری در زمینه مهندسی ژنتیک عمل کنیم.',
                username: 'bioethics_lover'
            }
        ]
    }
]

export default posts